sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/component/pmc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PMC_SLPWK_SR1_OFFSET                (0x13C)                                       /**<  (PMC_SLPWK_SR1) SleepWalking Status Register 1  Offset */

#define PMC_SLPWK_SR1_PID32_Pos             0                                              /**< (PMC_SLPWK_SR1) Peripheral 32 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID32_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID32_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 32 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID32                 PMC_SLPWK_SR1_PID32_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID32_Msk instead */
#define PMC_SLPWK_SR1_PID33_Pos             1                                              /**< (PMC_SLPWK_SR1) Peripheral 33 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID33_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID33_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 33 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID33                 PMC_SLPWK_SR1_PID33_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID33_Msk instead */
#define PMC_SLPWK_SR1_PID34_Pos             2                                              /**< (PMC_SLPWK_SR1) Peripheral 34 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID34_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID34_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 34 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID34                 PMC_SLPWK_SR1_PID34_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID34_Msk instead */
#define PMC_SLPWK_SR1_PID35_Pos             3                                              /**< (PMC_SLPWK_SR1) Peripheral 35 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID35_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID35_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 35 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID35                 PMC_SLPWK_SR1_PID35_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID35_Msk instead */
#define PMC_SLPWK_SR1_PID37_Pos             5                                              /**< (PMC_SLPWK_SR1) Peripheral 37 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID37_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID37_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 37 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID37                 PMC_SLPWK_SR1_PID37_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID37_Msk instead */
#define PMC_SLPWK_SR1_PID39_Pos             7                                              /**< (PMC_SLPWK_SR1) Peripheral 39 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID39_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID39_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 39 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID39                 PMC_SLPWK_SR1_PID39_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID39_Msk instead */
#define PMC_SLPWK_SR1_PID40_Pos             8                                              /**< (PMC_SLPWK_SR1) Peripheral 40 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID40_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID40_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 40 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID40                 PMC_SLPWK_SR1_PID40_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID40_Msk instead */
#define PMC_SLPWK_SR1_PID41_Pos             9                                              /**< (PMC_SLPWK_SR1) Peripheral 41 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID41_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID41_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 41 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID41                 PMC_SLPWK_SR1_PID41_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID41_Msk instead */
#define PMC_SLPWK_SR1_PID42_Pos             10                                             /**< (PMC_SLPWK_SR1) Peripheral 42 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID42_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID42_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 42 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID42                 PMC_SLPWK_SR1_PID42_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID42_Msk instead */
#define PMC_SLPWK_SR1_PID43_Pos             11                                             /**< (PMC_SLPWK_SR1) Peripheral 43 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID43_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID43_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 43 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID43                 PMC_SLPWK_SR1_PID43_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID43_Msk instead */
#define PMC_SLPWK_SR1_PID44_Pos             12                                             /**< (PMC_SLPWK_SR1) Peripheral 44 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID44_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID44_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 44 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID44                 PMC_SLPWK_SR1_PID44_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID44_Msk instead */
#define PMC_SLPWK_SR1_PID45_Pos             13                                             /**< (PMC_SLPWK_SR1) Peripheral 45 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID45_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID45_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 45 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID45                 PMC_SLPWK_SR1_PID45_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID45_Msk instead */
#define PMC_SLPWK_SR1_PID46_Pos             14                                             /**< (PMC_SLPWK_SR1) Peripheral 46 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID46_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID46_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 46 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID46                 PMC_SLPWK_SR1_PID46_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID46_Msk instead */
#define PMC_SLPWK_SR1_PID47_Pos             15                                             /**< (PMC_SLPWK_SR1) Peripheral 47 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID47_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID47_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 47 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID47                 PMC_SLPWK_SR1_PID47_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID47_Msk instead */
#define PMC_SLPWK_SR1_PID48_Pos             16                                             /**< (PMC_SLPWK_SR1) Peripheral 48 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID48_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID48_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 48 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID48                 PMC_SLPWK_SR1_PID48_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID48_Msk instead */
#define PMC_SLPWK_SR1_PID49_Pos             17                                             /**< (PMC_SLPWK_SR1) Peripheral 49 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID49_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID49_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 49 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID49                 PMC_SLPWK_SR1_PID49_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID49_Msk instead */
#define PMC_SLPWK_SR1_PID50_Pos             18                                             /**< (PMC_SLPWK_SR1) Peripheral 50 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID50_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID50_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 50 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID50                 PMC_SLPWK_SR1_PID50_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID50_Msk instead */
#define PMC_SLPWK_SR1_PID51_Pos             19                                             /**< (PMC_SLPWK_SR1) Peripheral 51 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID51_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID51_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 51 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID51                 PMC_SLPWK_SR1_PID51_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID51_Msk instead */
#define PMC_SLPWK_SR1_PID52_Pos             20                                             /**< (PMC_SLPWK_SR1) Peripheral 52 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID52_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID52_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 52 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID52                 PMC_SLPWK_SR1_PID52_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID52_Msk instead */
#define PMC_SLPWK_SR1_PID53_Pos             21                                             /**< (PMC_SLPWK_SR1) Peripheral 53 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID53_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID53_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 53 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID53                 PMC_SLPWK_SR1_PID53_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID53_Msk instead */
#define PMC_SLPWK_SR1_PID56_Pos             24                                             /**< (PMC_SLPWK_SR1) Peripheral 56 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID56_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID56_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 56 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID56                 PMC_SLPWK_SR1_PID56_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID56_Msk instead */
#define PMC_SLPWK_SR1_PID57_Pos             25                                             /**< (PMC_SLPWK_SR1) Peripheral 57 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID57_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID57_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 57 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID57                 PMC_SLPWK_SR1_PID57_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID57_Msk instead */
#define PMC_SLPWK_SR1_PID58_Pos             26                                             /**< (PMC_SLPWK_SR1) Peripheral 58 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID58_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID58_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 58 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID58                 PMC_SLPWK_SR1_PID58_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID58_Msk instead */
#define PMC_SLPWK_SR1_PID59_Pos             27                                             /**< (PMC_SLPWK_SR1) Peripheral 59 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID59_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID59_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 59 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID59                 PMC_SLPWK_SR1_PID59_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID59_Msk instead */
#define PMC_SLPWK_SR1_PID60_Pos             28                                             /**< (PMC_SLPWK_SR1) Peripheral 60 SleepWalking Status Position */
#define PMC_SLPWK_SR1_PID60_Msk             (_U_(0x1) << PMC_SLPWK_SR1_PID60_Pos)          /**< (PMC_SLPWK_SR1) Peripheral 60 SleepWalking Status Mask */
#define PMC_SLPWK_SR1_PID60                 PMC_SLPWK_SR1_PID60_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PMC_SLPWK_SR1_PID60_Msk instead */
#define PMC_SLPWK_SR1_MASK                  _U_(0x1F3FFFAF)                                /**< \deprecated (PMC_SLPWK_SR1) Register MASK  (Use PMC_SLPWK_SR1_Msk instead)  */
#define PMC_SLPWK_SR1_Msk                   _U_(0x1F3FFFAF)                                /**< (PMC_SLPWK_SR1) Register Mask  */

#define PMC_SLPWK_SR1_PID_Pos               0                                              /**< (PMC_SLPWK_SR1 Position) Peripheral 6x SleepWalking Status */
#define PMC_SLPWK_SR1_PID_Msk               (_U_(0x1FFFFFF) << PMC_SLPWK_SR1_PID_Pos)      /**< (PMC_SLPWK_SR1 Mask) PID */
#define PMC_SLPWK_SR1_PID(value)            (PMC_SLPWK_SR1_PID_Msk & ((value) << PMC_SLPWK_SR1_PID_Pos))  

/* -------- PMC_SLPWK_ASR1 : (PMC Offset: 0x140) (R/ 32) SleepWalking Activity Status Register 1 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t PID32:1;                   /**< bit:      0  Peripheral 32 Activity Status            */
    uint32_t PID33:1;                   /**< bit:      1  Peripheral 33 Activity Status            */
    uint32_t PID34:1;                   /**< bit:      2  Peripheral 34 Activity Status            */
    uint32_t PID35:1;                   /**< bit:      3  Peripheral 35 Activity Status            */
    uint32_t :1;                        /**< bit:      4  Reserved */
    uint32_t PID37:1;                   /**< bit:      5  Peripheral 37 Activity Status            */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t PID39:1;                   /**< bit:      7  Peripheral 39 Activity Status            */
    uint32_t PID40:1;                   /**< bit:      8  Peripheral 40 Activity Status            */
    uint32_t PID41:1;                   /**< bit:      9  Peripheral 41 Activity Status            */
    uint32_t PID42:1;                   /**< bit:     10  Peripheral 42 Activity Status            */
    uint32_t PID43:1;                   /**< bit:     11  Peripheral 43 Activity Status            */
    uint32_t PID44:1;                   /**< bit:     12  Peripheral 44 Activity Status            */
    uint32_t PID45:1;                   /**< bit:     13  Peripheral 45 Activity Status            */
    uint32_t PID46:1;                   /**< bit:     14  Peripheral 46 Activity Status            */
    uint32_t PID47:1;                   /**< bit:     15  Peripheral 47 Activity Status            */
    uint32_t PID48:1;                   /**< bit:     16  Peripheral 48 Activity Status            */
    uint32_t PID49:1;                   /**< bit:     17  Peripheral 49 Activity Status            */
    uint32_t PID50:1;                   /**< bit:     18  Peripheral 50 Activity Status            */
    uint32_t PID51:1;                   /**< bit:     19  Peripheral 51 Activity Status            */
    uint32_t PID52:1;                   /**< bit:     20  Peripheral 52 Activity Status            */
    uint32_t PID53:1;                   /**< bit:     21  Peripheral 53 Activity Status            */
    uint32_t :2;                        /**< bit: 22..23  Reserved */
    uint32_t PID56:1;                   /**< bit:     24  Peripheral 56 Activity Status            */
    uint32_t PID57:1;                   /**< bit:     25  Peripheral 57 Activity Status            */
    uint32_t PID58:1;                   /**< bit:     26  Peripheral 58 Activity Status            */
    uint32_t PID59:1;                   /**< bit:     27  Peripheral 59 Activity Status            */
    uint32_t PID60:1;                   /**< bit:     28  Peripheral 60 Activity Status            */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t PID:25;                    /**< bit:  0..24  Peripheral 6x Activity Status            */
    uint32_t :7;                        /**< bit: 25..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PMC_SLPWK_ASR1_Type;
